In [ ]:
#dataframes

In [1]:
import pandas as pd

In [2]:
#dataframes

In [3]:
roll = pd.Series([1,2,3,4,5])
name = pd.Series(['akku','kavya','musudu','sanskruti','sania'])
marks = pd.Series([76, 32,66,98,40])

In [4]:
df = pd.DataFrame({
    'roll': roll,
    'name': name,
    'marks': marks
})

In [5]:
df

   roll       name  marks
0     1       akku     76
1     2      kavya     32
2     3     musudu     66
3     4  sanskruti     98
4     5      sania     40

In [6]:
df.drop(2)

   roll       name  marks
0     1       akku     76
1     2      kavya     32
3     4  sanskruti     98
4     5      sania     40

In [10]:
#renaming

col = {'roll' : 'id' , 'marks' : 'grades'}

df.rename(columns = col)

   id       name  grades
0   1       akku      76
1   2      kavya      32
2   3     musudu      66
3   4  sanskruti      98
4   5      sania      40

In [12]:
ind = { 1 : 'one', 4 : 'four'}

df.rename(index = ind)

      roll       name  marks
0        1       akku     76
one      2      kavya     32
2        3     musudu     66
3        4  sanskruti     98
four     5      sania     40

In [16]:
#iterate

for x in df:
    print(x)

roll
name
marks

In [17]:
#print all data

In [19]:
#sort by values

df.sort_values(by = 'marks')

   roll       name  marks
1     2      kavya     32
4     5      sania     40
2     3     musudu     66
0     1       akku     76
3     4  sanskruti     98

In [22]:
df.sort_values(by = 'marks', ascending = False)

   roll       name  marks
3     4  sanskruti     98
0     1       akku     76
2     3     musudu     66
4     5      sania     40
1     2      kavya     32

In [24]:
df['marks'].max()

98

In [28]:
df['name'].str.title()

0         Akku
1        Kavya
2       Musudu
3    Sanskruti
4        Sania
Name: name, dtype: object

In [30]:
df['name'].str.startswith('s')

0    False
1    False
2    False
3     True
4     True
Name: name, dtype: bool

In [31]:
#add or modify column

In [32]:
df

   roll       name  marks
0     1       akku     76
1     2      kavya     32
2     3     musudu     66
3     4  sanskruti     98
4     5      sania     40

In [33]:
df['roll'] = df['roll'] + 100

In [34]:
df

   roll       name  marks
0   101       akku     76
1   102      kavya     32
2   103     musudu     66
3   104  sanskruti     98
4   105      sania     40

In [38]:
gender = ['f', 'f', 'f', 'f', 'f']

In [39]:
df['gender'] = gender

In [40]:
df

   roll       name  marks gender
0   101       akku     76      f
1   102      kavya     32      f
2   103     musudu     66      f
3   104  sanskruti     98      f
4   105      sania     40      f

In [41]:
#add new col called cgpa => marks/10 + 0.5

In [44]:
df['cgpa'] = df['marks']/10 + 0.5

In [45]:
df

   roll       name  marks gender  cgpa
0   101       akku     76      f   8.1
1   102      kavya     32      f   3.7
2   103     musudu     66      f   7.1
3   104  sanskruti     98      f  10.3
4   105      sania     40      f   4.5

In [50]:
df['gender'].mode()

0    f
Name: gender, dtype: object

In [51]:
### group by

In [52]:
gr = df.groupby('gender')

In [53]:
gr.groups

{'f': [0, 1, 2, 3, 4]}

In [55]:
gr.get_group('f')

   roll       name  marks gender  cgpa
0   101       akku     76      f   8.1
1   102      kavya     32      f   3.7
2   103     musudu     66      f   7.1
3   104  sanskruti     98      f  10.3
4   105      sania     40      f   4.5

In [56]:
gr['marks'].mean()

gender
f    62.4
Name: marks, dtype: float64

In [72]:
df.drop(['gender','cgpa'], axis=1, inplace = True)

In [67]:
#create a dataframe containing roll, gender, cgpa columns
#here roll column will be same as df

In [73]:
df

   roll       name  marks
0   101       akku     76
1   102      kavya     32
2   103     musudu     66
3   104  sanskruti     98
4   105      sania     40

In [82]:
cgpa = df['marks']/10+0.5

In [85]:
newdf = pd.DataFrame({
    'roll': range(0,4),
    'gender': gender,
    'cgpa': cgpa
})

ValueError: array length 4 does not match index length 5

In [81]:
df

   roll       name  marks
0   101       akku     76
1   102      kavya     32
2   103     musudu     66
3   104  sanskruti     98
4   105      sania     40

In [86]:
roll = pd.Series([6,7,8,9,10])
name = pd.Series(['akkuss','kau','musud','sans','san'])
marks = pd.Series([76, 32,66,98,40])

In [87]:
dft = pd.DataFrame({
    'roll': roll,
    'name': name,
    'marks': marks
})

In [88]:
dft

   roll    name  marks
0     6  akkuss     76
1     7     kau     32
2     8   musud     66
3     9    sans     98
4    10     san     40

In [89]:
pd.concat([df, dft], ignore_index= True)

   roll       name  marks
0   101       akku     76
1   102      kavya     32
2   103     musudu     66
3   104  sanskruti     98
4   105      sania     40
5     6     akkuss     76
6     7        kau     32
7     8      musud     66
8     9       sans     98
9    10        san     40

In [90]:
df['marks'] > 60

0     True
1    False
2     True
3     True
4    False
Name: marks, dtype: bool

In [93]:
df[df['marks'] > 60]

   roll       name  marks
0   101       akku     76
2   103     musudu     66
3   104  sanskruti     98

In [97]:
classs = ['BE','TE','BE','TE','TE']
df['classs'] = classs

In [98]:
df

   roll       name  marks classs
0   101       akku     76     BE
1   102      kavya     32     TE
2   103     musudu     66     BE
3   104  sanskruti     98     TE
4   105      sania     40     TE

In [101]:
x=df[(df['marks'] > 60) & (df['classs'] == 'BE')]
x

   roll    name  marks classs
0   101    akku     76     BE
2   103  musudu     66     BE

In [100]:
#export the dataset

In [102]:
x.to_csv('output.csv', index= False)